In [1]:
import boto3
import pandas as pd
from io import StringIO
from datetime import *

In [2]:
#paramterize the source, file format ,naming conventions 
#1 op file format 
arg_date_format='%Y%m%d_%H%M%S'
file_ext='.csv'

key ='employees_op_'+ datetime.today().strftime(arg_date_format)+file_ext

#2 source  bucekt 
src_bucket='buckets3stocholm'

#3 target bucekt 
trgt_bucket='buckets3stocholm'


#4 column list for op file 
columns_list=['EMPLOYEE_ID','HIRE_DATE', 'JOB_ID', 'SALARY', 'MANAGER_ID', 'DEPARTMENT_ID']

In [3]:
s3=boto3.resource('s3')
bucket=s3.Bucket(src_bucket)

In [4]:
bucket_obj1=bucket.objects.filter(Prefix='employees.csv')
bucket_obj2=bucket.objects.filter(Prefix='employees2.csv')
objects=[obj for obj in bucket_obj1] + [obj for obj in bucket_obj2]

In [5]:
objects

[s3.ObjectSummary(bucket_name='buckets3stocholm', key='employees.csv'),
 s3.ObjectSummary(bucket_name='buckets3stocholm', key='employees2.csv')]

In [6]:
## Lets create a data frame to hold the data from both the csv - from this we will get the column list 
df_dummy=bucket.Object(key=objects[0].key).get().get('Body').read().decode('utf8')
data_dummy=StringIO(df_dummy)
df1=pd.read_csv(data_dummy,delimiter=',')
df1.columns

Index(['EMPLOYEE_ID', 'FIRST_NAME', 'LAST_NAME', 'EMAIL', 'PHONE_NUMBER',
       'HIRE_DATE', 'JOB_ID', 'SALARY', 'MANAGER_ID', 'DEPARTMENT_ID'],
      dtype='object')

In [9]:
df_all=pd.DataFrame(columns=df1.columns)

for obj in objects:
    csv_emp=bucket.Object(key=obj.key).get().get('Body').read().decode('utf-8')
    data_emp=StringIO(csv_emp) 
    df=pd.read_csv(data_emp,delimiter=',')
   ## df_all=df_all.append(df) -- this is not working so as of now considering data of one file 
    df_all=df

In [10]:
df_all.count()

EMPLOYEE_ID      107
FIRST_NAME       107
LAST_NAME        107
EMAIL            107
PHONE_NUMBER     107
HIRE_DATE        107
JOB_ID           107
SALARY           107
MANAGER_ID       106
DEPARTMENT_ID    102
dtype: int64

In [11]:
#now fetch only needed columns from the file 

df_all=df_all.loc[:,columns_list]

In [12]:
df_all

     EMPLOYEE_ID  HIRE_DATE      JOB_ID  SALARY  MANAGER_ID  DEPARTMENT_ID
0            300   9/1/2009     AD_PRES   24000         NaN           90.0
1            301  12/7/2011       AD_VP   17000       100.0           90.0
2            302  3/31/2015       AD_VP   17000       100.0           90.0
3            303  3/20/2012     IT_PROG    9000       102.0           60.0
4            304   8/5/2013     IT_PROG    6000       103.0          100.0
..           ...        ...         ...     ...         ...            ...
102          402  11/2/2019      MK_REP    6000       201.0            NaN
103          403  8/22/2016      HR_REP    6500       101.0            NaN
104          404  8/22/2016      PR_REP   10000       101.0            NaN
105          405  8/22/2016      AC_MGR   12000       101.0            NaN
106          406  8/22/2016  AC_ACCOUNT    8300       205.0            NaN

[107 rows x 6 columns]

In [13]:
df_all.dropna(inplace=True) # Drop any empty values 
df_all.shape # check the size

(101, 6)

In [14]:
df_all

     EMPLOYEE_ID  HIRE_DATE    JOB_ID  SALARY  MANAGER_ID  DEPARTMENT_ID
1            301  12/7/2011     AD_VP   17000       100.0           90.0
2            302  3/31/2015     AD_VP   17000       100.0           90.0
3            303  3/20/2012   IT_PROG    9000       102.0           60.0
4            304   8/5/2013   IT_PROG    6000       103.0          100.0
5            305  9/10/2019   IT_PROG    4800       103.0          100.0
..           ...        ...       ...     ...         ...            ...
97           397   8/7/2020  SH_CLERK    3000       124.0           50.0
98           398   9/5/2021  SH_CLERK    2600       124.0           50.0
99           399  3/30/2022  SH_CLERK    2600       124.0           50.0
100          400  12/2/2009   AD_ASST    4400       101.0           10.0
101          401   5/4/2018    MK_MAN   13000       100.0           20.0

[101 rows x 6 columns]

In [15]:
# Now we can apply any required transformations here and prepare a report

In [16]:
#Copy back the data to S3 bucket 

print(key)

employees_op_20230407_170012.csv

In [17]:
op_data=StringIO()
df_all.to_csv(op_data,index=False)
bucket_target=s3.Bucket(trgt_bucket)
bucket_target.put_object(Body=op_data.getvalue(),Key=key)

s3.Object(bucket_name='buckets3stocholm', key='employees_op_20230407_170012.csv')

# Reading uploaded file

In [18]:
for obj in  bucket_target.objects.all():
    if (obj.key==key):
        print(obj.key)
        csv_obj=bucket_target.Object(key=obj.key).get().get('Body').read().decode('utf8')
        data=StringIO(csv_obj)
        emp_target=pd.read_csv(data,delimiter=',')

employees_op_20230407_170012.csv

In [19]:
 emp_target

     EMPLOYEE_ID  HIRE_DATE    JOB_ID  SALARY  MANAGER_ID  DEPARTMENT_ID
0            301  12/7/2011     AD_VP   17000       100.0           90.0
1            302  3/31/2015     AD_VP   17000       100.0           90.0
2            303  3/20/2012   IT_PROG    9000       102.0           60.0
3            304   8/5/2013   IT_PROG    6000       103.0          100.0
4            305  9/10/2019   IT_PROG    4800       103.0          100.0
..           ...        ...       ...     ...         ...            ...
96           397   8/7/2020  SH_CLERK    3000       124.0           50.0
97           398   9/5/2021  SH_CLERK    2600       124.0           50.0
98           399  3/30/2022  SH_CLERK    2600       124.0           50.0
99           400  12/2/2009   AD_ASST    4400       101.0           10.0
100          401   5/4/2018    MK_MAN   13000       100.0           20.0

[101 rows x 6 columns]